{
    "recipes": [
        {
            "id": 1,
            "name": "Ham and Swiss Omelet",
            "image": "./images/Ham-and-Swiss.jpeg",
            "type": "breakfast",
            "ingredients": ["1 tablespoon butter", "3 eggs", "3 tablespoons water", "1/8 teaspoon salt", "1/8 teaspoon pepper", "1/2 cup cubed fully cooked ham", "1/4 cup shredded Swiss cheese"],
            "directions": "1. In a small nonstick skillet, melt butter over medium-high heat. Whisk the eggs, water, salt and pepper. Add egg mixture to skillet (mixture should set immediately at edges). 2. As eggs set, push cooked edges toward the center, letting uncooked portion flow underneath. When the eggs are set, place ham on one side and sprinkle with cheese; fold other side over filling. Slide omelet onto a plate.",
            "likes": 0
            
        },
        {
            "id": 2,
            "name": "Banana Oatmeal Pankcakes",
            "image": "./images/Banana-Oatmeal-Pancakes.jpeg",
            "type": "breakfast",
            "ingredients": ["2 cups complete whole wheat pancake mix", "1 large firm banana, finely chopped", "1/2 cup old-fashioned oats", "1/4 cup chopped walnuts"],
            "directions": "Prepare pancake batter according to package directions. Stir in the banana, oats and walnuts. Pour batter by 1/4 cupfuls onto a hot griddle coated with cooking spray; turn when bubbles form on top. Cook until the second side is golden brown.",
            "likes": 0
        },
        {
            "id": 3,
            "name": "Sweet and Spicy Turkey Sandwich",
            "image": "./images/Sweet-and-Spicy-Turkey-Sandwich.jpeg",
            "type": "lunch",
            "ingredients": ["2 slices (1/2 inch thick) hearty country bread", "4 slices roasted turkey breast", "1 slice pepperjack cheese", "2 teaspoons butter", "4 teaspoons strawberry preserves"],
            "directions": "1. Heat a small skillet over medium heat. Butter one side of each of the bread slices with one teaspoon butter. Place one slice, butter side down, in the skillet. Top with the turkey and cheese slices. Place the second slice of bread on top, butter side up. 2. When the first side of the sandwich is golden brown, turn and brown the other side, 3 to 5 minutes per side, or until the cheese begins to melt. 3. Remove sandwich to a plate and top with strawberry preserves, or serve the preserves on the side.",
            "likes": 0
        },
        {
            "id": 4,
            "name": "Mexi-Chicken Avocado Cups",
            "image": "./images/Mexi-Chicken-Avocado-Cups.jpeg",
            "type": "lunch",
            "ingredients": ["3 (6 ounce) cans canned chicken, drained", "1 tablespoon cilantro, finely chopped", "1/2 teaspoon chili powder, or more to taste", "3 avocados, halved lengthwise and pitted", "1 teaspoon lime juice, or to taste"],
            "directions": "1. Stir chicken, cilantro, and chili powder together in a bowl. 2. Arrange avocado halves on serving dish and brush with lime juice. Spoon chicken mixture into avocado halves.",
            "likes": 0
        },
        {
            "id": 5,
            "name": "Homemade Chicken Potpie",
            "image": "./images/Homemade-Chicken-Potpie.jpeg",
            "type": "dinner",
            "ingredients": ["2 tablespoons canola oil", "1 medium onion, chopped", "1/2 cup all-purpose flour", "1 teaspoon poultry seasoning", "1 can (14-1/2 ounces) chicken broth", "3/4 cup 2% milk", "3 cups cubed cooked chicken", "2 cups frozen mixed vegetables (about 10 ounces), thawed", "1 sheet refrigerated pie crust"],
            "directions": "1. Preheat oven to 450°. In a large saucepan, heat oil over medium-high heat. Add onion; cook and stir until tender. Stir in flour and poultry seasoning until blended; gradually whisk in broth and milk. Bring to a boil, stirring constantly; cook and stir 2-3 minutes or until thickened. Stir in chicken and vegetables. 2. Transfer to a greased 9-in. deep-dish pie plate; place crust over filling. Trim, seal and flute edges. Cut slits in crust. Bake 15-20 minutes or until crust is golden brown and filling is bubbly.",
            "likes": 0

        },
        {
            "id": 6,
            "name": "Salsa Steak Garlic Toasts",
            "image": "./images/Salsa-Steak-Garlic-Toasts.jpeg",
            "type": "dinner",
            "ingredients": ["4 slices frozen garlic Texas toast", "1 tablespoon olive oil", "1 beef top sirloin steak (1 pound), thinly sliced", "1-1/2 cups salsa", "Sour cream and chopped fresh cilantro"],
            "directions": "1. Prepare garlic toast according to package directions. 2. Meanwhile, in a large skillet, heat oil over medium heat. Saute steak until no longer pink, 3-5 minutes; drain. Stir in salsa; cook and stir until heated through. Serve over toast. Top with sour cream and cilantro.",
            "likes": 0
        },
        {
            "id": 7,
            "name": "Chocolate Chip Cookie Dough Dip",
            "image": "./images/Chocolate-Chip-Cookie-Dough-Dip.jpeg",
            "type": "dessert",
            "ingredients": ["½ cup unsalted butter", "8 ounces cream cheese", "¼ cup powdered sugar", "¼ cup brown sugar", "1 teaspoon pure vanilla extract", "¼ teaspoon kosher salt", "1 cup semisweet mini chocolate chips"],
            "directions": "1. In the bowl of a stand mixer fitted with the paddle attachment, beat the butter, cream cheese, sugars, vanilla, and salt on low until smooth, about 2-4 minutes. 2. Fold in the mini chocolate chips until evenly distributed in the dip. 3. Serve with dippers like pretzels, green apples or chocolate graham crackers, waffle cones, or get really wild and try a sweet and salty combo with corn chip dippers!",
            "likes": 0

        },
        {
            "id": 8,
            "name": "Pineapple Bread Pudding",
            "image": "./images/Pineapple-Bread-Pudding.jpeg",
            "type": "dessert",
            "ingredients": ["4 tablespoons unsalted butter", "1½ cups granulated sugar", "3 large eggs", "1 cup milk", "20 ounces pineapple tidbits", "4 cups stale bread cubes"],
            "directions": "1. Preheat oven to 325°F. Spray a large casserole dish (9×13 inches or 2.5 quarts) with nonstick spray and set aside. 2. In a large mixing bowl, stir the melted butter and sugar together. Stir in the beaten eggs and milk. 3. Add in the pineapple and remaining juice and stir to combine. 4. Fold in the bread cubes slowly, being careful not to crush the bread. 5. Pour the mixture into the prepared casserole dish. 6. Bake for 1 hour, or until the center is set. 7. Top with brown sugar or cinnamon sugar (optional). 8. Serve as a side dish or dessert.",
            "likes": 0
        }

    ]









}